Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ལུས་ཀྱིའམ། སེམས་ལས་བྱུང་བའི་བརྩོན་འགྲུས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the diligence that arises from body or mind.

source: དེ་ཡང་མཁྱེན་པ་གང་གིས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅིང་། ཟག་པ་མེད་པའི་མཁྱེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་མཁྱེན་པས་རབ་ཏུ་མཁྱེན་ཏེ།
en: Moreover, by which knowledge does he genuinely know this? He correctly understands with an undefiled knowledge and a knowledge that transcends the world:

source: བརྩོན་འགྲུས་འདི་ནི་རྒྱུན་དུ་འཇུག་པའི་འབྲས་བུ་ལ་གནས་པར་འགྱུར།
en: ‘This diligence will lead to the result of a stream-enterer.

source: བརྩོན་འགྲུས་འདི་ནི་ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ལ་གནས་པར་འགྱུར།
en: This diligence will lead to the result of a once-returner.

source: བརྩོན་འགྲུས་འདི་ནི་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་གནས་པར་འགྱུར།
en: This diligence will lead to the result of a non-returner.

source: བརྩོན་འགྲུས་འདི་ནི་དགྲ་བཅོམ་པ་ལ་གནས་པར་འགྱུར།
en: This diligence will lead to the result of a worthy one.

source: བརྩོན་འགྲུས་འདི་ནི་རང་སངས་རྒྱས་ལ་གནས་པར་འགྱུར་རོ། །
en: This diligence will lead to the result of a solitary buddha.’

source: ཞེས་ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One genuinely knows the diligence faculty.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the diligence faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the diligence faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་སྐྱེ་བར་འགྱུར་བ། གལ་ཏེ་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པའམ། གལ་ཏེ་མལ་སྟན་ལ་གནས་པའམ། གལ་ཏེ་ཡུལ་ལ་གནས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One knows the causes and conditions by which the diligence faculty is formed. He correctly understands this, whether the causes and conditions are to follow a spiritual friend, to remain in one’s seat, or to dwell on an object.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the diligence faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the diligence faculty.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་སྐྱེས་ཏེ། རྒྱུ་དེ་དག་འགོག་པ་ལས་བརྩོན་འགྲུས་ཀྱི་འགོག་པ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He knows the causes and conditions by which the diligence faculty arises. From the cessation of those causes follows the cessation of diligence.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of the diligence faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the diligence faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་དག་གིས་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the diligence faculty.

source: དེ་བཞིན་གཤེགས་པ་བརྩོན་འགྲུས་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the diligence faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲན་པའི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the mindfulness faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་མངོན་པར་བརྗོད་པའི་མཚན་ཉིད་ནི་དྲན་པའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands that ‘mindfulness is the nature of naming.’

source: དྲན་པ་སོ་སོ་ཉེ་བར་གཞག་པ་ནི་དྲན་པའི་དབང་པོའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands that ‘the individual applications of mindfulness are the mindfulness faculty.’

source: ཐམས་ཅད་དུ་འགྲོ་བ་ནི་དྲན་པའི་དབང་པོའོ་ཞེས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands that ‘the mindfulness faculty is omnipresent.’

source: དེ་བཞིན་གཤེགས་པ་དྲན་པའི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the mindfulness faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲན་པའི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the mindfulness faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞི་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་དྲན་པའི་དབང་པོ་སྐྱེ་བའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One knows the causes and conditions by which the mindfulness faculty is formed.

source: གལ་ཏེ་སྔོན་གྱི་མཐའ་རྗེས་སུ་དྲན་པའམ། གལ་ཏེ་ཕྱི་མའི་མཐའ་ལས་བརྩམས་པའམ། གལ་ཏེ་ད་ལྟར་བྱུང་བའི་དུས་ལས་བརྩམས་པའམ། གལ་ཏེ་ལུས་ལ་དམིགས་པའམ། གལ་ཏེ་ཚོར་བ་ལ་དམིགས་པའམ། གལ་ཏེ་སེམས་ལ་དམིགས་པ་འམ། གལ་ཏེ་ཆོས་ལ་དམིགས་པའམ། གལ་ཏེ་འདོད་པ་ལ་དམིགས་པའམ། གལ་ཏེ་གནོད་སེམས་ལ་དམིགས་པའམ། གལ་ཏེ་རྣམ་པར་འཚེ་བ་ལ་དམིགས་པའམ། གལ་ཏེ་ངེས་པར་འབྱུང་བ་ལ་དམིགས་པའམ། གལ་ཏེ་གནོད་སེམས་མེད་པ་ལ་དམིགས་པའམ། གལ་ཏེ་རྣམ་པར་མི་འཚེ་བ་ལ་དམིགས་པའམ། གལ་ཏེ་སངས་རྒྱས་ལ་དམིགས་པའམ། གལ་ཏེ་ཆོས་ལ་དམིགས་པའམ། གལ་ཏེ་དགེ་འདུན་ལ་དམིགས་པའམ། ཚུལ་ཁྲིམས་ལ་དམིགས་པ་འམ། ཏིང་ངེ་འཛིན་ལ་དམིགས་པའམ། ཤེས་རབ་ལ་དམིགས་པའམ། རྣམ་པར་གྲོལ་བ་ལ་དམིགས་པའམ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་དམིགས་པའམ། གལ་ཏེ་ཟད་པ་ལ་དམིགས་པའམ། གལ་ཏེ་མི་སྐྱེ་བ་ལ་དམིགས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands this, whether it is recollected from the past, beginning in the future, or taking place in the present. He correctly understands this whether it is observing the body, observing feelings, observing the mind, observing phenomena, observing desire, observing ill will, observing harm, observing deliverance, observing absence of ill will, observing absence of harm, observing the Buddha, observing the Dharma, observing the Saṅgha, observing discipline, observing absorption, observing insight, observing liberation, observing the wisdom vision of liberation, observing exhaustion, or observing no-birth.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲན་པའི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the mindfulness faculty.

source: འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་དྲན་པའི་དབང་པོ་སྐྱེས་པའི་རྒྱུ་དེ་དག་འགོག་པ་ལས་དྲན་པའི་དབང་པོ་འགོག་སྟེ། དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One knows the causes and conditions by which the mindfulness faculty arises. From the cessation of those causes follows the cessation as related to the mindfulness faculty. That is what the Thus-Gone One correctly understands.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡང་ཞེས་བྱ་བ་ནས་ལོངས་སྤྱོད་པའི་བར་དུ་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་དྲན་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the mindfulness faculty.

source: ཤེས་པ་གང་གིས་དྲན་པའི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the mindfulness faculty.

source: དེ་བཞིན་གཤེགས་པ་དྲན་པའི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to knowledge of the mindfulness faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the absorption faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་སེམས་རྩེ་གཅིག་པ་ཉིད་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands one-pointed mind.

source: གལ་ཏེ་བསམ་གཏན་དང་པོའམ། གལ་ཏེ་བསམ་གཏན་གཉིས་པའམ། གལ་ཏེ་བསམ་གཏན་གསུམ་པའམ། གལ་ཏེ་བསམ་གཏན་བཞི་པའམ། གལ་ཏེ་བྱམས་པའམ། གལ་ཏེ་སྙིང་རྗེ་འམ། གལ་ཏེ་དགའ་བའམ། གལ་ཏེ་བཏང་སྙོམས་སམ། གལ་ཏེ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའམ། གལ་ཏེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་བར་རམ། གལ་ཏེ་རྣམ་པར་ཐར་པའམ། གལ་ཏེ་ཟད་པར་གྱི་སྐྱེ་མཆེད་དམ། གལ་ཏེ་ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་དེ་དག་གིས་ཇི་ལྟར་སེམས་རྩེ་གཅིག་པར་མངོན་དུ་གྱུར་པ་དེ། དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Thus-Gone One correctly understands how to actualize one-pointed mind whether by the first concentration, or the second concentration, or the third concentration, or the fourth concentration; or by love, or by compassion, or by joy, or by equanimity; or by resting in equanimity in the sphere of limitless space, or by resting in equanimity in the sphere of neither notion nor no notion; or by liberation, or the sphere of totality, or the sphere of mastery.

source: དེ་བཞིན་གཤེགས་པ་སེམས་རྩེ་གཅིག་པ་དེ་དག་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about those types of one-pointed mind,

source: བསྐལ་པར་ལན་གསུང་བ་ནས་
en: he can respond for an eon, and

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the absorption faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་སེམས་རྩེ་གཅིག་ཏུ་འགྱུར་བ། གལ་ཏེ་མི་གཙང་བའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་སྔོས་པའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་རུལ་བའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་ཟོས་པའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་ཚིག་པའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རུས་གོང་གི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་འཐོར་བའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་མི་ལྡན་པའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་ངེས་པར་འབྱུང་བའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་གནོད་སེམས་མེད་པའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་རྣམ་པར་མི་འཚེ་བའི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་སེམས་ཅན་གྱི་འདུ་ཤེས་ཀྱིས་སམ། གལ་ཏེ་ཆོས་ཀྱི་འདུ་ཤེས་ཀྱིས་ཏེ། དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, the Thus-Gone One correctly understands the causes and conditions by which one attains one-pointed mind whether it is the notion of impurity, the notion of a discolored corpse, the notion of a rotting corpse, the notion of a devoured corpse, the notion of a burned corpse, the notion of a skeleton, the notion of a scattered corpse, the notion of dispossession, the notion of deliverance, the notion of absence of ill will, the notion of absence of harm, the notion of sentient beings, or the notion of phenomena.

source: དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about this,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the absorption faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་སྐྱེས་པའི་རྒྱུ་དེ་དང་རྐྱེན་དེ་དག་འགོག་པ་ལས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་འགགས་ཏེ། དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One knows the causes and conditions by which the absorption faculty arises. From the cessation of those causes follows the cessation as related to the absorption faculty. That is what the Thus-Gone One correctly understands.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to knowledge of the absorption faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་པ་ནས།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the absorption faculty . . . .

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the insight faculty.

source: སྡུག་བསྔལ་གྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་མཐར་བྱེད་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་དང་འཁོར་བ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། ཕུང་པོ་དག་གི་རིམ་པ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། མི་སྡུག་པ་དང་ཕྲད་པ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། སྡུག་པ་དང་བྲལ་བ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། སྡུག་བསྔལ་གྱི་སྡུག་བསྔལ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། འགྱུར་བའི་སྡུག་བསྔལ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་དང་། འདུ་བྱེད་པའི་སྡུག་བསྔལ་དཔག་ཏུ་མེད་པའི་མཐར་བྱེད་པ་འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ།
en: The insight faculty is that which puts an end to the limitless heap of suffering. It is the insight faculty that puts an end to the limitless cycle of existence, the endless succession of the aggregates, the limitless encounters with the unpleasant, the endless separation from what is cherished, the limitless suffering of suffering, the limitless suffering of change, and the limitless suffering of conditioned existence.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྐྱེད་པ། ཡང་དག་པར་སྤོང་བ་བཞི་སྐྱེད་པ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་སྐྱེད་པ། དབང་པོ་ལྔ་སྐྱེད་པ། སྟོབས་ལྔ་སྐྱེད་པ། རྗེས་སུ་དྲན་པ་དྲུག་སྐྱེད་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་སྐྱེད་པ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྐྱེད་པ། ཞི་གནས་དང་ལྷག་མཐོང་སྐྱེད་པ། རིག་པ་སྐྱེད་པ། རྣམ་པར་གྲོལ་བ་སྐྱེད་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་སྐྱེད་པ། རྣམ་པར་ཐར་པའི་སྒོའི་མཆོག །སྒྲིབ་པ་མེད་པའི་མིག་འཁོར་བའི་སྐྱོན་ཡང་དག་པར་སྟོན་པ། མྱ་ངན་ལས་འདས་པའི་ཡོན་ཏན་ཤིན་ཏུ་བརྗོད་པ།
en: [It is the insight faculty] that produces the four applications of mindfulness, the four thorough relinquishments, the four bases of miraculous absorption, the five faculties, the five powers, the six remembrances, the seven branches of awakening, the eight aspects of the noble path, tranquility and special insight, understanding, liberation, the wisdom vision of liberation, and the supreme gateway to liberation. It is the insight faculty that produces the stainless eye, reveals the faults of saṃsāra, and declares the qualities of nirvāṇa.

source: འདས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་མཆོག་ཏུ་བྱ་བ་བྱས་པ། མ་འོངས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་མཆོག་ཏུ་བྱེད་པར་འགྱུར་བ། ད་ལྟར་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དག་ནསངས་རྒྱས་བཅོམ་ལྡན་འདས་བཞུགས་ཤིང་གཞེས་པ་དེ་དག་གིས་ཀྱང་། ཤེས་རབ་ཀྱི་དབང་པོ་འདི་མཆོག་ཏུ་མཛད་པ། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་འམ། བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཤེས་རབ་ཀྱི་དབང་པོའི་ཐོག་མ་སྟེ།
en: All thus-gone ones of the past have made the insight faculty supreme, all thus-gone ones of the future will make this supreme, and all the blessed buddhas who now dwell in all the limitless worlds are making the insight faculty supreme, whether it applies to the vehicle of the hearers, or the vehicle of the solitary buddhas, or the unsurpassed wisdom of the Buddha.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, in this way the Thus-Gone One correctly understands the knowledge of the insight faculty.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the insight faculty,

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་ལོངས་སྤྱོད་པའི་བར་དུ་འགྱུར་རོ། །
en: Therefore, he will enjoy this temple with its sandalwood courtyard.

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the origin as related to knowledge of the insight faculty.

source: རྒྱུ་གང་དང་རྐྱེན་གང་དག་གིས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཡང་དག་པར་འགྲུབ་པ་གལ་ཏེ་མི་རྟག་པའི་རྣམ་པས་སམ། དེ་བཞིན་དུ་སྦྱར་ཏེ་ཕྱིར་རྒོལ་བའི་རྣམ་པས་སམ། གལ་ཏེ་མུན་པའི་རྣམ་པས་སམ། གལ་ཏེ་མི་རྟག་པ་དང་རྗེས་སུ་འབྲེལ་བའི་རྣམ་པས་སམ། གལ་ཏེ་དབུས་སུ་སྤྱོད་པའི་རྣམ་པས་སམ། གལ་ཏེ་མཛའ་བའི་རྣམ་པས་སམ། འདི་ལྟ་སྟེ། གལ་ཏེ་མི་མཛའ་བ་ལ་མཛའ་བཤེས་ལྟ་བུའི་རྣམ་པས་སམ། གལ་ཏེ་སྐྱོན་དུ་བལྟ་བའི་རྣམ་པས་སམ། གལ་ཏེ་སྒྱིད་ལུག་པའི་རྣམ་པས་སམ། གལ་ཏེ་ཡིད་བརྟན་དུ་མི་རུང་བའི་རྣམ་པས་སམ། གལ་ཏེ་ཆུའི་སྲིན་པོའི་རྣམ་པས་ཏེ།
en: [He knows] the causes and conditions by which one accomplishes knowledge of the insight faculty, whether related to the features of impermanence, and so forth, up until the features of opposition, as well as the features of darkness, the features connected with impermanence, the features of socializing, the features of friends, the features of perceiving those who are not friends to be friends, the features of perceiving faults, the features of procrastination, the features of unreliability, and the features of sea monsters.

source: རྣམ་པ་དེ་ལྟ་བུ་དཔག་ཏུ་མེད་པ་འབུམ་དེ་དག་གིས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: By means of such hundreds of thousands of limitless features, he correctly understands the knowledge of the origin as related to knowledge of the insight faculty.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the origin as related to knowledge of the insight faculty,

source: བསྐལ་པར་ལན་གསུང་བ་ན།
en: he can respond for an eon, and

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the insight faculty.

source: ཤེས་རབ་ཀྱི་དབང་པོ་ནི་སྐྱེད་པའི་ཆོས་ཅན་ཡིན་ལ། སྐྱེད་པའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་ནི་འགོག་པའི་ཆོས་ཅན་ཏེ།
en: The insight faculty has arisen and whatever has arisen must also cease.

source: ཤེས་རབ་དེ་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་གྱི་ཕྱིར་སྐྱེས་ཤིང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ནས་འགགས།
en: This knowledge arises in order to benefit limitless beings and, once it has accomplished the welfare of a boundless number of beings, it ceases.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱས་ཤིང་དོན་མ་ཡིན་པ་བཟློག་ནས་འགགས།
en: Having accomplished the welfare of an immeasurable number of beings and refrained from harming them, it ceases.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་མཛད་ནས་འགགས།
en: Having freed innumerable beings from suffering, it ceases.

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་བདེ་བ་ལ་བཙུད་ནས་འགགས་ཏེ།
en: [Having freed innumerable beings from suffering, it ceases.] Having established them in happiness, it ceases.

source: ཤེས་རབ་ཀྱི་དབང་པོ་རྗེས་སུ་དྲན་པ་ན་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་བྱེད་པར་འགྱུར། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་དོན་མ་ཡིན་པ་བཟློག་པར་འགྱུར་ཞིང་འགགས།
en: Even by recollecting the insight faculty, it will accomplish the welfare of innumerable beings, one will refrain from harming them, and then it will cease.

source: ཤེས་རབ་ཀྱི་དབང་པོ་རྗེས་སུ་དྲན་པ་ན་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་པར་འགྱུར། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་བདེ་བ་ལ་བཙུད་པར་འགྱུར་ཞིང་འགགས་ཏེ།
en: Even by recollecting the insight faculty it will free innumerable beings from suffering, establish them in happiness, and then cease.

source: ཤེས་རབ་ཀྱི་དབང་པོ་རྗེས་སུ་དྲན་པ་ན་ཡང་སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་མུན་པ་སེལ་བར་འགྱུར། སེམས་ཅན་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་སྣང་བར་བྱེད་པར་འགྱུར་ཞིང་འགགས།
en: Even by recollecting the insight faculty, it will clear away the darkness of innumerable beings, illuminate innumerable beings, and then cease.

source: ཤེས་རབ་ཀྱི་དབང་པོ་རྗེས་སུ་དྲན་པ་ན་ཡང་ལམ་གོལ་བ་འགོག་པར་འགྱུར་ཞིང་ལམ་འབྱེད་པར་འགྱུར་ཏེ།
en: Even by recollecting the insight faculty, it will block errant paths and open wide the proper path.

source: འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཞེས་བྱའོ། །
en: That is called knowing cessation as related to knowledge of the insight faculty.

source: དེ་ལ་ཤེས་པ་དང་། མཐོང་བ་དང་། གསལ་བ་དང་། མངོན་པར་རྟོགས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པ་དང་། མཁས་པ་གང་ཡིན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཞེས་བྱ་སྟེ
en: To know, see, perceive, realize, understand, and be skillful about this is called knowing cessation as related to knowledge of the insight faculty .

source: དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: That is what the Thus-Gone One correctly understands.

source: ཁྱིམ་བདག་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Householder, this is how the Thus-Gone One correctly understands the knowledge of cessation as related to knowledge of the insight faculty.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of cessation as related to knowledge of insight faculty,

source: ཁྱིམ་བདག་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: “Householder, you may wonder how the Thus-Gone One correctly understands the knowledge of the path that leads to cessation as related to the insight faculty.

source: ཁྱིམ་བདག་འདི་ལ་དེ་བཞིན་གཤེགས་པས་ཤེས་པ་གང་གིས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་པའི་འགོག་པ་ཤེས་པ་དེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ།
en: Householder, the Thus-Gone One correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the insight faculty.

source: གལ་ཏེ་མངོན་པར་ཤེས་པའི་ཤེས་པས་སམ། གལ་ཏེ་ཡོངས་སུ་ཤེས་པའི་ཤེས་པས་སམ། གལ་ཏེ་སྤོང་བའི་ཤེས་པས་སམ། གལ་ཏེ་བསྒོམ་པའི་ཤེས་པས་སམ། གལ་ཏེ་མངོན་སུམ་དུ་བྱས་པའི་ཤེས་པ་དེ་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Whether by the knowledge of clairvoyance, or the knowledge of ascertainment, or the knowledge of abandonment, or the knowledge of training, or the knowledge of actualization, the Thus-Gone One correctly understands.

source: ཤེས་པ་གང་གིས་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་ཡོངས་སུ་ཤེས། ཁོང་དུ་ཆུད། མངོན་སུམ་དུ་བྱས་ནས་འགོག་པ་ཤེས་པ་དེ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏོ། །
en: He correctly understands the knowledge of cessation by which he knows, understands, and actualizes the knowledge of the insight faculty, and which is unlike that of any hearer or solitary buddha.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་དབང་པོ་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་དེ་ལ་ཡང་ཞུ་བ་ཞུས་པ་ན།
en: When the Thus-Gone One is asked about the knowledge of the path that leads to cessation as related to the insight faculty,
